<h1>О программе ПРОПУСК</h1>
<p>Приложение написано в учебных целях по образу реального работающего приложения на одном из крупнейших промышленных предприятий
 Волгоградской области (на котором автору посчастливилось поработать менеджеру по импортным закупкам) используя фреймворк Yii2
 (На предприятии, судя по всему, приложение было написано без использования фреймворков).</p>
<p>Приложение предназначено для организации контрольно-пропускной системы предприятия с возможностью контролировать автотранспорт
и частных посетителей(специалисты подрядных организаций,менеджеры по продажам, торговые представители и пр.). </p>
<p>Пользователи разделяются на четыре роли:

<ol>
<li> Инженеры коммерческих отделов и другие сотрудники предприятия, которые могут создавать пропуска на автотранспорт и частных посетителей.</li>
<li> Подтверждающие - руководители подразделений и отделов, которые проверяют и утверждают пропуска.</li>
<li> Диспетчеры КПП и сотрудники службы безопасности, которым доступна информация об автотранспорте и посетителях только для чтения
в целях контроля и для проверки документов на КПП.</li>
<li>Администратор - может добавлять и удалять пользователей, назначать права и т.д..</li>
</ol>
</p>
